// // Задание 1
// let i = 1;

// while (i <= 2){
//     console.log('Привет');
//     i++;
// }

// // Задание 2
// let i = 1;

// while (i <= 5){
//     console.log(i);
//     i++;
// }

// // Задание 3
// let i = 7;

// while (i <= 26){
//     console.log(i);
//     i++;
// }

// // Задание 4
// const obj = {
//     'Коля' : '200',
//     'Вася' : '300',
//     'Петя' : '400'
// }

// for (let salary in obj  ) {
//     console.log(`${salary} - зарплата ${obj[salary]} долларов.`);
// }

// // Задание 5
// let n = 1000;
// let num = 0;

// while(n >= 50){
//     n = n/2;
//     num++;
//     console.log(`Итераций: ${num},число: ${n}`);
// }

// // Задание 6
// let i = 2;

// while (i <= 31) {
//     console.log(`Сегодня пятница, ${i}-е число. Необходимо подготовить отчет.`);
//     i = i + 7;
// }
